In [296]:
import pandas as pd
import numpy as np

##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [297]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인

df = pd.read_csv('./data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [298]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
Survived, x = df['Survived'].groupby(df['Survived'] == 1).count()
Survived, x

(549, 342)

In [299]:
# 2. 승객 나이의 평균 출력
print(df['Age'].mean())

29.69911764705882

In [300]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
df[df['Pclass'] == 1].sort_values('Fare',ascending=False).head(1).filter(like='Name')

                 Name
258  Ward, Miss. Anna

In [301]:
# 4. 여성 승객의 수를 구하여 출력
df[df['Sex'] == 'female'].filter(like='Sex').size

314

In [302]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
df[df['Fare'] >= 50].filter(items=['Name', 'Fare'])

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [303]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
len(df[(df['Age'] < 18) & (df['Survived'] == 1)]) / len(df[(df['Age'] < 18)])

0.5398230088495575

In [304]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
df[df['Pclass'] == 2].filter(items=['Fare']).values.mean()

np.float64(20.662183152173913)

In [305]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
df.sort_values('Age', ascending=False).head(1).filter(items=['Age', 'Name'])

      Age                                  Name
630  80.0  Barkworth, Mr. Algernon Henry Wilson

In [306]:
# 9. S 항구에서 탑승한 승객의 수를 출력
len(df[df['Embarked'] == 'S'])

644

In [307]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
len(df[(df['Sex'] == 'male') & (df['Pclass'] == 3)])

347

- 고급문제

In [308]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
df.groupby(['Survived', 'Pclass'])['Age'].mean()

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [309]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
df[df['SibSp'] >= 3].filter(items=['Fare', 'Name', 'Age']).sort_values('Fare', ascending=False).head()

       Fare                            Name   Age
27   263.00  Fortune, Mr. Charles Alexander  19.0
88   263.00      Fortune, Miss. Mabel Helen  23.0
341  263.00  Fortune, Miss. Alice Elizabeth  24.0
159   69.55      Sage, Master. Thomas Henry   NaN
180   69.55    Sage, Miss. Constance Gladys   NaN

In [333]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
df[df['Age'].isna()]['Embarked'].groupby(df['Embarked']).count()

Embarked
C    38
Q    49
S    90
Name: Embarked, dtype: int64

In [370]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
df[(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)][['Name', 'Sex', 'Survived']]

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [382]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
pm = df[(df['Pclass'] == 1)]
pm[pm['Fare'] > pm['Fare'].mean()][['Name', 'Age', 'Fare']]

                                                  Name   Age      Fare
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN  146.5208
88                          Fortune, Miss. Mabel Helen  23.0  263.0000
118                           Baxter, Mr. Quigg Edmond  24.0  247.5208
195                               Lurette, Miss. Elise  58.0  146.5208
..                                                 ...   ...       ...
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  43.0  211.3375
802                Carter, Master. William Thornton II  11.0  120.0000
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  52.0   93.5000
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   NaN   89.1042
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667

[66 rows x 3 columns]

In [401]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
df[(df['Age'].notnull()) & (df['Pclass'].notnull()) & (df['Fare'].notnull())][['Fare']].groupby(df['Pclass']).agg(['mean', 'median'])

             Fare
             mean   median
Pclass
1       87.961582  69.3000
2       21.471556  15.0458
3       13.229435   8.0500

In [424]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
print(df['Age'].groupby(df['Embarked']).mean())
print(len(df[(df['Embarked'] == 'S') & (df['Survived'] == 1)]) / df['Embarked'].groupby(df['Embarked']).count().max())

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
0.33695652173913043

In [427]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
len(df[(df['Sex'] == 'female') & (df['Age'] >= 30)]) / len(df)

0.12794612794612795

In [433]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
len(df[df['SibSp'] + df['Parch'] >= 3]) / len(df)

0.10213243546576879

In [470]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
df[(df['Cabin'].notnull()) & (df['Survived'] == 1)].groupby(df['Pclass']).size() / len(df)

Pclass
1    0.131313
2    0.014590
3    0.006734
dtype: float64